areiter128/pstpl-p33c-tdal/p33c_pral/exth/p33c_devices.h
/* Microchip Technology Inc. and its subsidiaries.  You may use this software 
 * and any derivatives exclusively with Microchip products. 
 * 
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS".  NO WARRANTIES, WHETHER 
 * EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED 
 * WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A 
 * PARTICULAR PURPOSE, OR ITS INTERACTION WITH MICROCHIP PRODUCTS, COMBINATION 
 * WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION. 
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
 * INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND 
 * WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS 
 * BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE 
 * FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS 
 * IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF 
 * ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * MICROCHIP PROVIDES THIS SOFTWARE CONDITIONALLY UPON YOUR ACCEPTANCE OF THESE 
 * TERMS. 
 */

/**
 * @file   p33c_devices.h
 * @author M91406
 * @brief  List of additional, generalized device identifier filter macros
 * @details
 *  Additional abstraction macros for more flexible device selections 
 *  of device families and derivatives
 */

// This is a guard condition so that contents of this file are not included
// more than once.  
#ifndef P33C_DEVICE_IDENTIFIER_MACROS_H
#define	P33C_DEVICE_IDENTIFIER_MACROS_H

/**
 * @def     __P33C__
 * @ingroup p33c-pral-did
 * @brief   Digital Power Supply Digital Signal Controller Device Identification Macros
 * @details
 *  Some peripheral features must be tailored to the specific target 
 *  device selected at design time. 
 * 
 *  The device identification macros provided by this additional header 
 *  file allows detailed filtering:
 *
 *  - identification/ignoring of device family
 *  - identification/ignoring of device pin count
 *  - identification/ignoring of memory size
 * 
 * <b><u>Example</u></b><br>
 *  MPLAB X allows to identify selected target devices by using macros
 *  incorporating the part number of the device selected. The following
 *  example identifies dsPIC33CK32MP105 has been selected. This header
 *  file decodes the part number providing the following, additional
 *  device identification macros:
 * 
 *  - MPLAB X default macro: __dsPIC33CK32MP105__
 *  - XC16-PRAL Device IDs:  
 *     - __P33SMPS__
 *     - __P33SMPS_CK__
 *     - __P33SMPS_CK1__
 *     - __P33SMPS_CK105__
 *     - __P33SMPS_ARA__
 * 
 *  The following statement may be used to filter features tailoring
 *  code sections to the target device in question. Here, a user code
 *  section is tailored for devices of devices families Ara (dsPIC33CKxxMP10x)
 *  and Sagitta without CAN module (dsPIC33CKxxMP20x):
 * 
 *  @code{.c}
 *    #if defined (__P33SMPS_CK1__) || defined (__P33SMPS_CK2__)
 * 
 *      // [ some user code ]
 * 
 *    #endif
 *  @endcode
 * 
 */
#define __P33C__
#define __P33C_MP__

// ----------------------------------------------
// Gemini family of devices without CAN FD
#if defined (__dsPIC33CH64MP202__) || defined (__dsPIC33CH128MP202__)

    #define __P33SMPS_CH__              // Device family ID
    #define __P33SMPS_CHM__             // Device family ID main core
    #define __P33SMPS_CH2__             // Device family ID with peripheral set code
    #define __P33SMPS_CH202__           // Device family ID with peripheral set and pin-count code
    #define __P33SMPS_GEMINI__          // Device family name
    #define __P33SMPS_GEMINIM__         // Device family name with MAIN core extension 
    #define __P33SMPS_PINCOUNT__        28U // Number of device pins

    #define P33C_UART_COUNT             2U  // Number of UART modules
    #define P33C_CANFD_COUNT            0U  // Number of CAN FD modules
    #define P33C_SENT_COUNT             2U  // Number of SENT modules
    #define P33C_PG_COUNT               4U  // Number of PWM generators
    #define P33C_PGA_COUNT              0U  // Number of PGAs
    #define P33C_OPA_COUNT              0U  // Number of Operational Amplifiers
    #define P33C_DAC_COUNT              1U  // Number of DACs/Comparators
    #define P33C_I2C_COUNT              2U  // Number of I2C interfaces
    #define P33C_SPI_COUNT              2U  // Number of SPI interfaces
    #define P33C_PTG_COUNT              1U  // Number of Peripheral Trigger Generator instances
    #define P33C_CRC_COUNT              1U  // Number of Cyclic Redundancy Check instances
    #define P33C_CLC_COUNT              4U  // Number of Configurable Logic Cell instances
    #define P33C_QEI_COUNT              1U  // Number of Quadrature Encoder Interfaces
    #define P33C_DMA_COUNT              6U  // Number of Direct Memory Access channels
    #define P33C_SCCP_COUNT             8U  // Number of Capture/Compare/Timer instances
    #define P33C_MCCP_COUNT             0U  // Number of Multiple Capture/Compare/PWM instances

    #define P33C_ADC_ADCMP_COUNT        4U  // Number of ADC Digital Comparators
    #define P33C_ADC_ADFL_COUNT         4U  // Number of ADC Digital Filters
    #define P33C_ADC_CORE_COUNT         1U  // Number of ADC Cores available
    #define P33C_ADCAN_COUNT            12U // Number of analog inputs
    #define P33C_ADC_SHARED_CORE_INDEX  7U  // Artificially assigned index for shared ADC core

    #define REG_ADC_CHANNEL_L_MSK       0b0000111111111111      // Mask of available ADC inputs 0-15
    #define REG_ADC_CHANNEL_H_MSK       0b0000000000000000      // Mask of available ADC inputs 16-n

#elif defined (__dsPIC33CH64MP202S1__) || defined (__dsPIC33CH128MP202S1__)

    #define __P33SMPS_CH__              // Device family ID
    #define __P33SMPS_CHS__             // Device family ID secondary core
    #define __P33SMPS_CH2__             // Device family ID with peripheral set code
    #define __P33SMPS_CH202__           // Device family ID with peripheral set and pin-count code
    #define __P33SMPS_GEMINI__          // Device family name
    #define __P33SMPS_GEMINIS__         // Device family name with SECONDARY core extension 
    #define __P33SMPS_PINCOUNT__        28U // Number of device pins

    #define P33C_UART_COUNT             1U  // Number of UART modules
    #define P33C_CANFD_COUNT            0U  // Number of CAN FD modules
    #define P33C_SENT_COUNT             0U  // Number of SENT modules
    #define P33C_PG_COUNT               8U  // Number of PWM generators
    #define P33C_PGA_COUNT              3U  // Number of PGAs
    #define P33C_OPA_COUNT              0U  // Number of Operational Amplifiers
    #define P33C_DAC_COUNT              3U  // Number of DACs/Comparators
    #define P33C_I2C_COUNT              1U  // Number of I2C interfaces
    #define P33C_SPI_COUNT              1U  // Number of SPI interfaces
    #define P33C_PTG_COUNT              0U  // Number of Peripheral Trigger Generator instances
    #define P33C_CRC_COUNT              0U  // Number of Cyclic Redundancy Check instances
    #define P33C_CLC_COUNT              4U  // Number of Configurable Logic Cell instances
    #define P33C_QEI_COUNT              1U  // Number of Quadrature Encoder Interfaces
    #define P33C_DMA_COUNT              2U  // Number of Direct Memory Access channels
    #define P33C_SCCP_COUNT             4U  // Number of Capture/Compare/Timer instances
    #define P33C_MCCP_COUNT             0U  // Number of Multiple Capture/Compare/PWM instances

    #define P33C_ADC_ADCMP_COUNT        4U  // Number of ADC Digital Comparators
    #define P33C_ADC_ADFL_COUNT         4U  // Number of ADC Digital Filters
    #define P33C_ADC_CORE_COUNT         3U  // Number of ADC Cores
    #define P33C_ADCAN_COUNT            11U // Number of analog inputs
    #define P33C_ADC_SHARED_CORE_INDEX  7U  // Artificially assigned index for shared ADC core

    #define REG_ADC_CHANNEL_L_MSK       0b0000011111111111  // Mask of available ADC inputs 0-15
    #define REG_ADC_CHANNEL_H_MSK       0b0000000000000000  // Mask of available ADC inputs 16-n

#elif defined (__dsPIC33CH64MP203__) || defined (__dsPIC33CH128MP203__)

