areiter128/pstpl-p33c-tdal/p33c_pral/exth/p33c_devices.h
// ----------------------------------------------
// Sagittarius family of devices with CAN FD
#if defined (__dsPIC33CH256MP505__) || defined (__dsPIC33CH512MP505__)

    #define __P33SMPS_CH__              // Device family ID
    #define __P33SMPS_CHM__             // Device family ID main core
    #define __P33SMPS_CH5__             // Device family ID with peripheral set code
    #define __P33SMPS_CH505__           // Device family ID with peripheral set and pin-count code
    #define __P33SMPS_CHE__             // Device family ID with "Extended" flag
    #define __P33SMPS_CHEM__            // Device family ID main core with "Extended" flag
    #define __P33SMPS_SAGITTARIUS__     // Device family name
    #define __P33SMPS_SAGITTARIUSM__    // Device family name with MAIN core extension 
    #define __P33SMPS_PINCOUNT__        48U // Number of device pins

    #define P33C_UART_COUNT             2U  // Number of UART modules
    #define P33C_CANFD_COUNT            2U  // Number of CAN FD modules
    #define P33C_SENT_COUNT             2U  // Number of SENT modules
    #define P33C_PG_COUNT               4U  // Number of PWM generators
    #define P33C_PGA_COUNT              0U  // Number of PGAs
    #define P33C_OPA_COUNT              0U  // Number of Operational Amplifiers
    #define P33C_DAC_COUNT              1U  // Number of DACs/Comparators
    #define P33C_I2C_COUNT              2U  // Number of I2C interfaces
    #define P33C_SPI_COUNT              2U  // Number of SPI interfaces
    #define P33C_PTG_COUNT              1U  // Number of Peripheral Trigger Generator instances
    #define P33C_CRC_COUNT              1U  // Number of Cyclic Redundancy Check instances
    #define P33C_CLC_COUNT              4U  // Number of Configurable Logic Cell instances
    #define P33C_QEI_COUNT              1U  // Number of Quadrature Encoder Interfaces
    #define P33C_DMA_COUNT              6U  // Number of Direct Memory Access channels
    #define P33C_SCCP_COUNT             8U  // Number of Capture/Compare/Timer instances
    #define P33C_MCCP_COUNT             0U  // Number of Multiple Capture/Compare/PWM instances

    #define P33C_ADC_ADCMP_COUNT        4U  // Number of ADC Digital Comparators
    #define P33C_ADC_ADFL_COUNT         4U  // Number of ADC Digital Filters
    #define P33C_ADC_CORE_COUNT         1U  // Number of ADC Cores
    #define P33C_ADCAN_COUNT            16U // Number of analog inputs
    #define P33C_ADC_SHARED_CORE_INDEX  7U  // Artificially assigned index for shared ADC core

    #define REG_ADC_CHANNEL_L_MSK       0b1111111111111111  // Mask of available ADC inputs 0-15
    #define REG_ADC_CHANNEL_H_MSK       0b0000000000000000  // Mask of available ADC inputs 16-n

#elif defined (__dsPIC33CH256MP505S1__) || defined (__dsPIC33CH512MP505S1__)

    #define __P33SMPS_CH__              // Device family ID
    #define __P33SMPS_CHS__             // Device family ID secondary core
    #define __P33SMPS_CH5__             // Device family ID with peripheral set code
    #define __P33SMPS_CH505__           // Device family ID with peripheral set and pin-count code
    #define __P33SMPS_CHE__             // Device family ID with "Extended" flag
    #define __P33SMPS_CHES__            // Device family ID secondary core with "Extended" flag
    #define __P33SMPS_SAGITTARIUS__     // Device family name
    #define __P33SMPS_SAGITTARIUSS__    // Device family name with SECONDARY core extension 
    #define __P33SMPS_PINCOUNT__        48U // Number of device pins

    #define P33C_UART_COUNT             1U  // Number of UART modules
    #define P33C_CANFD_COUNT            0U  // Number of CAN FD modules
    #define P33C_SENT_COUNT             0U  // Number of SENT modules
    #define P33C_PG_COUNT               8U  // Number of PWM generators
    #define P33C_PGA_COUNT              3U  // Number of PGAs
    #define P33C_OPA_COUNT              0U  // Number of Operational Amplifiers
    #define P33C_DAC_COUNT              3U  // Number of DACs/Comparators
    #define P33C_I2C_COUNT              1U  // Number of I2C interfaces
    #define P33C_SPI_COUNT              1U  // Number of SPI interfaces
    #define P33C_PTG_COUNT              0U  // Number of Peripheral Trigger Generator instances
    #define P33C_CRC_COUNT              0U  // Number of Cyclic Redundancy Check instances
    #define P33C_CLC_COUNT              4U  // Number of Configurable Logic Cell instances
    #define P33C_QEI_COUNT              1U  // Number of Quadrature Encoder Interfaces
    #define P33C_DMA_COUNT              2U  // Number of Direct Memory Access channels
    #define P33C_SCCP_COUNT             4U  // Number of Capture/Compare/Timer instances
    #define P33C_MCCP_COUNT             0U  // Number of Multiple Capture/Compare/PWM instances

    #define P33C_ADC_ADCMP_COUNT        4U  // Number of ADC Digital Comparators
    #define P33C_ADC_ADFL_COUNT         4U  // Number of ADC Digital Filters
    #define P33C_ADC_CORE_COUNT         3U  // Number of ADC Cores
    #define P33C_ADCAN_COUNT            15U // Number of analog inputs
    #define P33C_ADC_SHARED_CORE_INDEX  7U  // Artificially assigned index for shared ADC core

    #define REG_ADC_CHANNEL_L_MSK       0b0111111111111111  // Mask of available ADC inputs 0-15
    #define REG_ADC_CHANNEL_H_MSK       0b0000000000000000  // Mask of available ADC inputs 16-n

#elif defined (__dsPIC33CH256MP506__) || defined (__dsPIC33CH512MP506__)

    #define __P33SMPS_CH__              // Device family ID
    #define __P33SMPS_CHM__             // Device family ID main core
    #define __P33SMPS_CH5__             // Device family ID with peripheral set code
    #define __P33SMPS_CH506__           // Device family ID with peripheral set and pin-count code
    #define __P33SMPS_CHE__             // Device family ID with "Extended" flag
    #define __P33SMPS_CHEM__            // Device family ID main core with "Extended" flag
    #define __P33SMPS_SAGITTARIUS__     // Device family name
    #define __P33SMPS_SAGITTARIUSM__    // Device family name with MAIN core extension 
    #define __P33SMPS_PINCOUNT__        64U // Number of device pins

    #define P33C_UART_COUNT             2U  // Number of UART modules
    #define P33C_CANFD_COUNT            2U  // Number of CAN FD modules
    #define P33C_SENT_COUNT             2U  // Number of SENT modules
    #define P33C_PG_COUNT               4U  // Number of PWM generators
    #define P33C_PGA_COUNT              0U  // Number of PGAs
    #define P33C_OPA_COUNT              0U  // Number of Operational Amplifiers
    #define P33C_DAC_COUNT              1U  // Number of DACs/Comparators
    #define P33C_I2C_COUNT              2U  // Number of I2C interfaces
    #define P33C_SPI_COUNT              2U  // Number of SPI interfaces
    #define P33C_PTG_COUNT              1U  // Number of Peripheral Trigger Generator instances
    #define P33C_CRC_COUNT              1U  // Number of Cyclic Redundancy Check instances
    #define P33C_CLC_COUNT              4U  // Number of Configurable Logic Cell instances
    #define P33C_QEI_COUNT              1U  // Number of Quadrature Encoder Interfaces
    #define P33C_DMA_COUNT              6U  // Number of Direct Memory Access channels
    #define P33C_SCCP_COUNT             8U  // Number of Capture/Compare/Timer instances
    #define P33C_MCCP_COUNT             0U  // Number of Multiple Capture/Compare/PWM instances

    #define P33C_ADC_ADCMP_COUNT        4U  // Number of ADC Digital Comparators
    #define P33C_ADC_ADFL_COUNT         4U  // Number of ADC Digital Filters
    #define P33C_ADC_CORE_COUNT         1U  // Number of ADC Cores
    #define P33C_ADCAN_COUNT            16U // Number of analog inputs
    #define P33C_ADC_SHARED_CORE_INDEX  7U  // Artificially assigned index for shared ADC core

    #define REG_ADC_CHANNEL_L_MSK       0b1111111111111111  // Mask of available ADC inputs 0-15
    #define REG_ADC_CHANNEL_H_MSK       0b0000000000000000  // Mask of available ADC inputs 16-n

#elif defined (__dsPIC33CH256MP506S1__) || defined (__dsPIC33CH512MP506S1__)

