areiter128/pstpl-p33c-tdal/p33c_pral/exth/p33c_devices.h
// ----------------------------
// Sagitta family of devices with CAN FD
#if defined (__dsPIC33CK32MP502__) || defined (__dsPIC33CK64MP502__) || defined (__dsPIC33CK128MP502__) || defined (__dsPIC33CK256MP502__)

    #define __P33SMPS_CK__              // Device family ID
    #define __P33SMPS_CK5__             // Device family ID with peripheral set code
    #define __P33SMPS_CK502__           // Device family ID with peripheral set and pin-count code
    #define __P33SMPS_SAGITTA__         // Device family name
    #define __P33SMPS_PINCOUNT__        28U // Number of device pins

    #define P33C_UART_COUNT             3U  // Number of UART modules
    #define P33C_CANFD_COUNT            1U  // Number of CAN FD modules
    #define P33C_SENT_COUNT             2U  // Number of SENT modules
    #define P33C_PG_COUNT               8U  // Number of PWM generators
    #define P33C_PGA_COUNT              0U  // Number of PGAs
    #define P33C_OPA_COUNT              2U  // Number of Operational Amplifiers
    #define P33C_DAC_COUNT              3U  // Number of DACs/Comparators
    #define P33C_I2C_COUNT              3U  // Number of I2C interfaces
    #define P33C_SPI_COUNT              3U  // Number of SPI interfaces
    #define P33C_PTG_COUNT              1U  // Number of Peripheral Trigger Generator instances
    #define P33C_CRC_COUNT              1U  // Number of Cyclic Redundancy Check instances
    #define P33C_CLC_COUNT              4U  // Number of Configurable Logic Cell instances
    #define P33C_QEI_COUNT              2U  // Number of Quadrature Encoder Interfaces
    #define P33C_DMA_COUNT              4U  // Number of Direct Memory Access channels
    #define P33C_SCCP_COUNT             8U  // Number of Capture/Compare/Timer instances
    #define P33C_MCCP_COUNT             1U  // Number of Multiple Capture/Compare/PWM instances

    #define P33C_ADC_ADCMP_COUNT        4U  // Number of ADC Digital Comparators
    #define P33C_ADC_ADFL_COUNT         4U  // Number of ADC Digital Filters
    #define P33C_ADC_CORE_COUNT         3U  // Number of ADC Cores
    #define P33C_ADCAN_COUNT            12U // Number of analog inputs
    #define P33C_ADC_SHARED_CORE_INDEX  7U  // Artificially assigned index for shared ADC core

    #define REG_ADC_CHANNEL_L_MSK       0b0000111111111111  // Mask of available ADC inputs 0-15
    #define REG_ADC_CHANNEL_H_MSK       0b0000000000000000  // Mask of available ADC inputs 16-n

#elif defined (__dsPIC33CK32MP503__) || defined (__dsPIC33CK64MP503__) || defined (__dsPIC33CK128MP503__) || defined (__dsPIC33CK256MP503__)

    #define __P33SMPS_CK__              // Device family ID
    #define __P33SMPS_CK5__             // Device family ID with peripheral set code
    #define __P33SMPS_CK503__           // Device family ID with peripheral set and pin-count code
    #define __P33SMPS_SAGITTA__         // Device family name
    #define __P33SMPS_PINCOUNT__        36U // Number of device pins

    #define P33C_UART_COUNT             3U  // Number of UART modules
    #define P33C_CANFD_COUNT            1U  // Number of CAN FD modules
    #define P33C_SENT_COUNT             2U  // Number of SENT modules
    #define P33C_PG_COUNT               8U  // Number of PWM generators
    #define P33C_PGA_COUNT              0U  // Number of PGAs
    #define P33C_OPA_COUNT              3U  // Number of Operational Amplifiers
    #define P33C_DAC_COUNT              3U  // Number of DACs/Comparators
    #define P33C_I2C_COUNT              3U  // Number of I2C interfaces
    #define P33C_SPI_COUNT              3U  // Number of SPI interfaces
    #define P33C_PTG_COUNT              1U  // Number of Peripheral Trigger Generator instances
    #define P33C_CRC_COUNT              1U  // Number of Cyclic Redundancy Check instances
    #define P33C_CLC_COUNT              4U  // Number of Configurable Logic Cell instances
    #define P33C_QEI_COUNT              2U  // Number of Quadrature Encoder Interfaces
    #define P33C_DMA_COUNT              4U  // Number of Direct Memory Access channels
    #define P33C_SCCP_COUNT             8U  // Number of Capture/Compare/Timer instances
    #define P33C_MCCP_COUNT             1U  // Number of Multiple Capture/Compare/PWM instances

    #define P33C_ADC_ADCMP_COUNT        4U  // Number of ADC Digital Comparators
    #define P33C_ADC_ADFL_COUNT         4U  // Number of ADC Digital Filters
    #define P33C_ADC_CORE_COUNT         3U  // Number of ADC Cores
    #define P33C_ADCAN_COUNT            16U // Number of analog inputs
    #define P33C_ADC_SHARED_CORE_INDEX  7U  // Artificially assigned index for shared ADC core

    #define REG_ADC_CHANNEL_L_MSK       0b1111111111111111  // Mask of available ADC inputs 0-15
    #define REG_ADC_CHANNEL_H_MSK       0b0000000000000000  // Mask of available ADC inputs 16-n

#elif defined (__dsPIC33CK32MP505__) || defined (__dsPIC33CK64MP505__) || defined (__dsPIC33CK128MP505__) || defined (__dsPIC33CK256MP505__)

    #define __P33SMPS_CK__              // Device family ID
    #define __P33SMPS_CK5__             // Device family ID with peripheral set code
    #define __P33SMPS_CK505__           // Device family ID with peripheral set and pin-count code
    #define __P33SMPS_SAGITTA__         // Device family name
    #define __P33SMPS_PINCOUNT__        48U // Number of device pins

    #define P33C_UART_COUNT             3U  // Number of UART modules
    #define P33C_CANFD_COUNT            1U  // Number of CAN FD modules
    #define P33C_SENT_COUNT             2U  // Number of SENT modules
    #define P33C_PG_COUNT               8U  // Number of PWM generators
    #define P33C_PGA_COUNT              0U  // Number of PGAs
    #define P33C_OPA_COUNT              3U  // Number of Operational Amplifiers
    #define P33C_DAC_COUNT              3U  // Number of DACs/Comparators
    #define P33C_I2C_COUNT              3U  // Number of I2C interfaces
    #define P33C_SPI_COUNT              3U  // Number of SPI interfaces
    #define P33C_PTG_COUNT              1U  // Number of Peripheral Trigger Generator instances
    #define P33C_CRC_COUNT              1U  // Number of Cyclic Redundancy Check instances
    #define P33C_CLC_COUNT              4U  // Number of Configurable Logic Cell instances
    #define P33C_QEI_COUNT              2U  // Number of Quadrature Encoder Interfaces
    #define P33C_DMA_COUNT              4U  // Number of Direct Memory Access channels
    #define P33C_SCCP_COUNT             8U  // Number of Capture/Compare/Timer instances
    #define P33C_MCCP_COUNT             1U  // Number of Multiple Capture/Compare/PWM instances

    #define P33C_ADC_ADCMP_COUNT        4U  // Number of ADC Digital Comparators
    #define P33C_ADC_ADFL_COUNT         4U  // Number of ADC Digital Filters
    #define P33C_ADC_CORE_COUNT         3U  // Number of ADC Cores
    #define P33C_ADCAN_COUNT            19U // Number of analog inputs
    #define P33C_ADC_SHARED_CORE_INDEX  7U  // Artificially assigned index for shared ADC core

    #define REG_ADC_CHANNEL_L_MSK       0b1111111111111111  // Mask of available ADC inputs 0-15
    #define REG_ADC_CHANNEL_H_MSK       0b0000000000000111  // Mask of available ADC inputs 16-n

#elif defined (__dsPIC33CK32MP506__) || defined (__dsPIC33CK64MP506__) || defined (__dsPIC33CK128MP506__) || defined (__dsPIC33CK256MP506__)

    #define __P33SMPS_CK__              // Device family ID
    #define __P33SMPS_CK5__             // Device family ID with peripheral set code
    #define __P33SMPS_CK506__           // Device family ID with peripheral set and pin-count code
    #define __P33SMPS_SAGITTA__         // Device family name
    #define __P33SMPS_PINCOUNT__        64U // Number of device pins

    #define P33C_UART_COUNT             3U  // Number of UART modules
    #define P33C_CANFD_COUNT            1U  // Number of CAN FD modules
    #define P33C_SENT_COUNT             2U  // Number of SENT modules
    #define P33C_PG_COUNT               8U  // Number of PWM generators
    #define P33C_PGA_COUNT              0U  // Number of PGAs
    #define P33C_OPA_COUNT              3U  // Number of Operational Amplifiers
    #define P33C_DAC_COUNT              3U  // Number of DACs/Comparators
    #define P33C_I2C_COUNT              3U  // Number of I2C interfaces
    #define P33C_SPI_COUNT              3U  // Number of SPI interfaces
    #define P33C_PTG_COUNT              1U  // Number of Peripheral Trigger Generator instances
    #define P33C_CRC_COUNT              1U  // Number of Cyclic Redundancy Check instances
    #define P33C_CLC_COUNT              4U  // Number of Configurable Logic Cell instances
    #define P33C_QEI_COUNT              2U  // Number of Quadrature Encoder Interfaces
    #define P33C_DMA_COUNT              4U  // Number of Direct Memory Access channels
    #define P33C_SCCP_COUNT             8U  // Number of Capture/Compare/Timer instances
    #define P33C_MCCP_COUNT             1U  // Number of Multiple Capture/Compare/PWM instances

    #define P33C_ADC_ADCMP_COUNT        4U  // Number of ADC Digital Comparators
    #define P33C_ADC_ADFL_COUNT         4U  // Number of ADC Digital Filters
    #define P33C_ADC_CORE_COUNT         3U  // Number of ADC Cores
    #define P33C_ADCAN_COUNT            20U // Number of analog inputs
    #define P33C_ADC_SHARED_CORE_INDEX  7U  // Artificially assigned index for shared ADC core

    #define REG_ADC_CHANNEL_L_MSK       0b1111111111111111  // Mask of available ADC inputs 0-15
    #define REG_ADC_CHANNEL_H_MSK       0b0000000000001111  // Mask of available ADC inputs 16-n

#elif defined (__dsPIC33CK64MP508__) || defined (__dsPIC33CK128MP508__) || defined (__dsPIC33CK256MP508__)

    #define __P33SMPS_CK__              // Device family ID
    #define __P33SMPS_CK5__             // Device family ID with peripheral set code
    #define __P33SMPS_CK508__           // Device family ID with peripheral set and pin-count code
    #define __P33SMPS_SAGITTA__         // Device family name
    #define __P33SMPS_PINCOUNT__        80U // Number of device pins

    #define P33C_UART_COUNT             3U  // Number of UART modules
    #define P33C_CANFD_COUNT            1U  // Number of CAN FD modules
    #define P33C_SENT_COUNT             2U  // Number of SENT modules
    #define P33C_PG_COUNT               8U  // Number of PWM generators
    #define P33C_PGA_COUNT              0U  // Number of PGAs
    #define P33C_OPA_COUNT              3U  // Number of Operational Amplifiers
    #define P33C_DAC_COUNT              3U  // Number of DACs/Comparators
    #define P33C_I2C_COUNT              3U  // Number of I2C interfaces
    #define P33C_SPI_COUNT              3U  // Number of SPI interfaces
    #define P33C_PTG_COUNT              1U  // Number of Peripheral Trigger Generator instances
    #define P33C_CRC_COUNT              1U  // Number of Cyclic Redundancy Check instances
    #define P33C_CLC_COUNT              4U  // Number of Configurable Logic Cell instances
    #define P33C_QEI_COUNT              2U  // Number of Quadrature Encoder Interfaces
    #define P33C_DMA_COUNT              4U  // Number of Direct Memory Access channels
    #define P33C_SCCP_COUNT             8U  // Number of Capture/Compare/Timer instances
    #define P33C_MCCP_COUNT             1U  // Number of Multiple Capture/Compare/PWM instances

    #define P33C_ADC_ADCMP_COUNT        4U  // Number of ADC Digital Comparators
    #define P33C_ADC_ADFL_COUNT         4U  // Number of ADC Digital Filters
    #define P33C_ADC_CORE_COUNT         3U  // Number of ADC Cores
    #define P33C_ADCAN_COUNT            24U // Number of analog inputs
    #define P33C_ADC_SHARED_CORE_INDEX  7U  // Artificially assigned index for shared ADC core

    #define REG_ADC_CHANNEL_L_MSK       0b1111111111111111  // Mask of available ADC inputs 0-15
    #define REG_ADC_CHANNEL_H_MSK       0b0000000011111111  // Mask of available ADC inputs 16-n

#endif

