areiter128/pstpl-p33c-tdal/p33c_pral/exth/p33c_devices.h
#elif defined (__dsPIC33CK256MP410__) || defined (__dsPIC33CK512MP410__) || defined (__dsPIC33CK1024MP410__)

    #define __P33SMPS_CK__              // Device family ID
    #define __P33SMPS_CK4__             // Device family ID with peripheral set code
    #define __P33SMPS_CK410__           // Device family ID with peripheral set and pin-count code
    #define __P33SMPS_SAGITTAPP__       // Device family name
    #define __P33SMPS_PINCOUNT__        100U // Number of device pins

    #define P33C_UART_COUNT             3U  // Number of UART modules
    #define P33C_CANFD_COUNT            0U  // Number of CAN FD modules
    #define P33C_SENT_COUNT             2U  // Number of SENT modules
    #define P33C_PG_COUNT               8U  // Number of PWM generators
    #define P33C_PGA_COUNT              0U  // Number of PGAs
    #define P33C_OPA_COUNT              3U  // Number of Operational Amplifiers
    #define P33C_DAC_COUNT              6U  // Number of DACs/Comparators
    #define P33C_I2C_COUNT              3U  // Number of I2C interfaces
    #define P33C_SPI_COUNT              3U  // Number of SPI interfaces
    #define P33C_PTG_COUNT              1U  // Number of Peripheral Trigger Generator instances
    #define P33C_CRC_COUNT              1U  // Number of Cyclic Redundancy Check instances
    #define P33C_CLC_COUNT              8U  // Number of Configurable Logic Cell instances
    #define P33C_QEI_COUNT              3U  // Number of Quadrature Encoder Interfaces
    #define P33C_DMA_COUNT              8U  // Number of Direct Memory Access channels
    #define P33C_SCCP_COUNT             8U  // Number of Capture/Compare/Timer instances
    #define P33C_MCCP_COUNT             1U  // Number of Multiple Capture/Compare/PWM instances

    #define P33C_ADC_ADCMP_COUNT        4U  // Number of ADC Digital Comparators
    #define P33C_ADC_ADFL_COUNT         4U  // Number of ADC Digital Filters
    #define P33C_ADC_CORE_COUNT         5U  // Number of ADC Cores
    #define P33C_ADCAN_COUNT            28U // Number of analog inputs
    #define P33C_ADC_SHARED_CORE_INDEX  7U  // Artificially assigned index for shared ADC core

    #define REG_ADC_CHANNEL_L_MSK       0b1111111111111111  // Mask of available ADC inputs 0-15
    #define REG_ADC_CHANNEL_H_MSK       0b0000111111111111  // Mask of available ADC inputs 16-n

#endif

// ----------------------------
// Sagitta++ family of devices with CAN FD
#if defined (__dsPIC33CK256MP705__) || defined (__dsPIC33CK512MP705__) || defined (__dsPIC33CK1024MP705__)

    #define __P33SMPS_CK__              // Device family ID
    #define __P33SMPS_CK7__             // Device family ID with peripheral set code
    #define __P33SMPS_CK705__           // Device family ID with peripheral set and pin-count code
    #define __P33SMPS_SAGITTAPP__       // Device family name
    #define __P33SMPS_PINCOUNT__        48U // Number of device pins

    #define P33C_UART_COUNT             3U  // Number of UART modules
    #define P33C_CANFD_COUNT            2U  // Number of CAN FD modules
    #define P33C_SENT_COUNT             2U  // Number of SENT modules
    #define P33C_PG_COUNT               8U  // Number of PWM generators
    #define P33C_PGA_COUNT              0U  // Number of PGAs
    #define P33C_OPA_COUNT              3U  // Number of Operational Amplifiers
    #define P33C_DAC_COUNT              6U  // Number of DACs/Comparators
    #define P33C_I2C_COUNT              3U  // Number of I2C interfaces
    #define P33C_SPI_COUNT              3U  // Number of SPI interfaces
    #define P33C_PTG_COUNT              1U  // Number of Peripheral Trigger Generator instances
    #define P33C_CRC_COUNT              1U  // Number of Cyclic Redundancy Check instances
    #define P33C_CLC_COUNT              8U  // Number of Configurable Logic Cell instances
    #define P33C_QEI_COUNT              3U  // Number of Quadrature Encoder Interfaces
    #define P33C_DMA_COUNT              8U  // Number of Direct Memory Access channels
    #define P33C_SCCP_COUNT             8U  // Number of Capture/Compare/Timer instances
    #define P33C_MCCP_COUNT             1U  // Number of Multiple Capture/Compare/PWM instances

    #define P33C_ADC_ADCMP_COUNT        4U  // Number of ADC Digital Comparators
    #define P33C_ADC_ADFL_COUNT         4U  // Number of ADC Digital Filters
    #define P33C_ADC_CORE_COUNT         5U  // Number of ADC Cores
    #define P33C_ADCAN_COUNT            19U // Number of analog inputs
    #define P33C_ADC_SHARED_CORE_INDEX  7U  // Artificially assigned index for shared ADC core

    #define REG_ADC_CHANNEL_L_MSK       0b1111111111111111  // Mask of available ADC inputs 0-15
    #define REG_ADC_CHANNEL_H_MSK       0b0000000000000111  // Mask of available ADC inputs 16-n

#elif defined (__dsPIC33CK256MP706__) || defined (__dsPIC33CK512MP706__) || defined (__dsPIC33CK1024MP706__)

    #define __P33SMPS_CK__              // Device family ID
    #define __P33SMPS_CK7__             // Device family ID with peripheral set code
    #define __P33SMPS_CK706__           // Device family ID with peripheral set and pin-count code
    #define __P33SMPS_SAGITTAPP__       // Device family name
    #define __P33SMPS_PINCOUNT__        64U // Number of device pins

    #define P33C_UART_COUNT             3U  // Number of UART modules
    #define P33C_CANFD_COUNT            2U  // Number of CAN FD modules
    #define P33C_SENT_COUNT             2U  // Number of SENT modules
    #define P33C_PG_COUNT               8U  // Number of PWM generators
    #define P33C_PGA_COUNT              0U  // Number of PGAs
    #define P33C_OPA_COUNT              3U  // Number of Operational Amplifiers
    #define P33C_DAC_COUNT              6U  // Number of DACs/Comparators
    #define P33C_I2C_COUNT              3U  // Number of I2C interfaces
    #define P33C_SPI_COUNT              3U  // Number of SPI interfaces
    #define P33C_PTG_COUNT              1U  // Number of Peripheral Trigger Generator instances
    #define P33C_CRC_COUNT              1U  // Number of Cyclic Redundancy Check instances
    #define P33C_CLC_COUNT              8U  // Number of Configurable Logic Cell instances
    #define P33C_QEI_COUNT              3U  // Number of Quadrature Encoder Interfaces
    #define P33C_DMA_COUNT              8U  // Number of Direct Memory Access channels
    #define P33C_SCCP_COUNT             8U  // Number of Capture/Compare/Timer instances
    #define P33C_MCCP_COUNT             1U  // Number of Multiple Capture/Compare/PWM instances

    #define P33C_ADC_ADCMP_COUNT        4U  // Number of ADC Digital Comparators
    #define P33C_ADC_ADFL_COUNT         4U  // Number of ADC Digital Filters
    #define P33C_ADC_CORE_COUNT         5U  // Number of ADC Cores
    #define P33C_ADCAN_COUNT            20U // Number of analog inputs
    #define P33C_ADC_SHARED_CORE_INDEX  7U  // Artificially assigned index for shared ADC core

    #define REG_ADC_CHANNEL_L_MSK       0b1111111111111111  // Mask of available ADC inputs 0-15
    #define REG_ADC_CHANNEL_H_MSK       0b0000000000001111  // Mask of available ADC inputs 16-n

#elif defined (__dsPIC33CK256MP708__) || defined (__dsPIC33CK512MP708__) || defined (__dsPIC33CK1024MP708__)

    #define __P33SMPS_CK__              // Device family ID
    #define __P33SMPS_CK7__             // Device family ID with peripheral set code
    #define __P33SMPS_CK708__           // Device family ID with peripheral set and pin-count code
    #define __P33SMPS_SAGITTAPP__       // Device family name
    #define __P33SMPS_PINCOUNT__        80U // Number of device pins

    #define P33C_UART_COUNT             3U  // Number of UART modules
    #define P33C_CANFD_COUNT            2U  // Number of CAN FD modules
    #define P33C_SENT_COUNT             2U  // Number of SENT modules
    #define P33C_PG_COUNT               8U  // Number of PWM generators
    #define P33C_PGA_COUNT              0U  // Number of PGAs
    #define P33C_OPA_COUNT              3U  // Number of Operational Amplifiers
    #define P33C_DAC_COUNT              6U  // Number of DACs/Comparators
    #define P33C_I2C_COUNT              3U  // Number of I2C interfaces
    #define P33C_SPI_COUNT              3U  // Number of SPI interfaces
    #define P33C_PTG_COUNT              1U  // Number of Peripheral Trigger Generator instances
    #define P33C_CRC_COUNT              1U  // Number of Cyclic Redundancy Check instances
    #define P33C_CLC_COUNT              8U  // Number of Configurable Logic Cell instances
    #define P33C_QEI_COUNT              3U  // Number of Quadrature Encoder Interfaces
    #define P33C_DMA_COUNT              8U  // Number of Direct Memory Access channels
    #define P33C_SCCP_COUNT             8U  // Number of Capture/Compare/Timer instances
    #define P33C_MCCP_COUNT             1U  // Number of Multiple Capture/Compare/PWM instances

    #define P33C_ADC_ADCMP_COUNT        4U  // Number of ADC Digital Comparators
    #define P33C_ADC_ADFL_COUNT         4U  // Number of ADC Digital Filters
    #define P33C_ADC_CORE_COUNT         5U  // Number of ADC Cores
    #define P33C_ADCAN_COUNT            24U // Number of analog inputs
    #define P33C_ADC_SHARED_CORE_INDEX  7U  // Artificially assigned index for shared ADC core

    #define REG_ADC_CHANNEL_L_MSK       0b1111111111111111  // Mask of available ADC inputs 0-15
    #define REG_ADC_CHANNEL_H_MSK       0b0000000011111111  // Mask of available ADC inputs 16-n

#elif defined (__dsPIC33CK256MP710__) || defined (__dsPIC33CK512MP710__) || defined (__dsPIC33CK1024MP710__)

    #define __P33SMPS_CK__              // Device family ID
    #define __P33SMPS_CK7__             // Device family ID with peripheral set code
    #define __P33SMPS_CK710__           // Device family ID with peripheral set and pin-count code
    #define __P33SMPS_SAGITTAPP__       // Device family name
    #define __P33SMPS_PINCOUNT__        100U // Number of device pins

    #define P33C_UART_COUNT             3U  // Number of UART modules
    #define P33C_CANFD_COUNT            2U  // Number of CAN FD modules
    #define P33C_SENT_COUNT             2U  // Number of SENT modules
    #define P33C_PG_COUNT               8U  // Number of PWM generators
    #define P33C_PGA_COUNT              0U  // Number of PGAs
    #define P33C_OPA_COUNT              3U  // Number of Operational Amplifiers
    #define P33C_DAC_COUNT              6U  // Number of DACs/Comparators
    #define P33C_I2C_COUNT              3U  // Number of I2C interfaces
    #define P33C_SPI_COUNT              3U  // Number of SPI interfaces
    #define P33C_PTG_COUNT              1U  // Number of Peripheral Trigger Generator instances
    #define P33C_CRC_COUNT              1U  // Number of Cyclic Redundancy Check instances
    #define P33C_CLC_COUNT              8U  // Number of Configurable Logic Cell instances
    #define P33C_QEI_COUNT              3U  // Number of Quadrature Encoder Interfaces
    #define P33C_DMA_COUNT              8U  // Number of Direct Memory Access channels
    #define P33C_SCCP_COUNT             8U  // Number of Capture/Compare/Timer instances
    #define P33C_MCCP_COUNT             1U  // Number of Multiple Capture/Compare/PWM instances

    #define P33C_ADC_ADCMP_COUNT        4U  // Number of ADC Digital Comparators
    #define P33C_ADC_ADFL_COUNT         4U  // Number of ADC Digital Filters
    #define P33C_ADC_CORE_COUNT         5U  // Number of ADC Cores
    #define P33C_ADCAN_COUNT            28U // Number of analog inputs
    #define P33C_ADC_SHARED_CORE_INDEX  7U  // Artificially assigned index for shared ADC core

    #define REG_ADC_CHANNEL_L_MSK       0b1111111111111111  // Mask of available ADC inputs 0-15
    #define REG_ADC_CHANNEL_H_MSK       0b0000111111111111  // Mask of available ADC inputs 16-n

#endif

// ----------------------------
// Device Family-Specific Feature Flags
#if defined (__P33SMPS_SAGITTAP__) || defined (__P33SMPS_SAGITTAPP__)

    #ifndef P33C_EDS           // Guard macro declaration as this macro may also be defined elsewhere
      #define P33C_EDS         // Define flag that this device supports extended data space (EDS) addressing
    #endif

#endif

// ----------------------------
// Trigger for UNSUPPORTED DEVICE compiler message
#if defined (__P33SMPS_ARA__) || defined (__P33SMPS_SAGITTA__) || defined (__P33SMPS_SAGITTAP__) || \
    defined (__P33SMPS_OCTANSP__) || defined (__P33SMPS_SAGITTAPP__) || \
    defined (__P33SMPS_GEMINI__) || defined (__P33SMPS_SAGITTARIUS__)

#else
    #pragma message "selected device not supported by this version of the peripheral register abstraction layer libraries"
#endif

#endif	/* P33C_DEVICE_IDENTIFIER_MACROS_H */

// __________________________
// end of file
